#include<stdio.h>
//猴子吃桃问题
int main()
{
	int i =1;//最后一天
	int m =1;//剩余桃子数

	for(i=1;10>i;i++)
	{
	m=2*(m+1);
	printf("%d\n",m);//第i天的桃子
	}
	printf("%d\n",m);//第十天的桃子
		
	return 0;
}
//_______________________________________________________________
//有一对兔子，从出生后第3个月起每个月都生一对兔子，
//小兔子长到第三个月后每个月又生一对兔子，
//假如兔子都不死，问每个月的兔子总数为多少？
int main()
{
	int m=0;//大兔子
	int s=1;//小兔子
	int d=0;
	for(int i=1;i<3;i++)//前两个月无大兔子
	{	
		printf("第%d月有%d对小兔子无大兔子\n",i,s);
	}
	for(i=3;i<10;i++)//三月份开始有大兔子
	{
		d=s;//小兔子长大了
		printf("第%d月有%5d对大兔子有%5d对小兔子共有%5d只兔子\n",i,m,s,2*(m+s));
		s=s+m;//小兔子在长大大兔子生小兔子
		m=d;//小兔子长大了	
	}

	return 0;
}
//_______________________________________________________________
//"水仙花数"是指一个三位数，其各位数字立方和等于该数本身。
#include<math.h>
int main()
{
	int a=0;//百位数
	int b=0;//十位数
	int c=0;//个位数
	int i=0;//水仙花数

	for(a=1;a<10;a++)
	{
		for(b=0;b<10;b++)
		{
			for(c=0;c<10;c++)
			{
				i=a*100+b*10+c;
				if(i==pow(a,3)+pow(b,3)+pow(c,3))
				{
					printf("%d\n",i);
				}
			}
		}
	}

	return 0;
}
//_______________________________________________________________
//一球从100米高度自由落下，每次落地后反跳回原高度的一半；
//再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
int main()
{
	float h=100;//初始高度
	float H=0;//总路径
	for(int i=0;i<100;i++)
	{
		H=H+h*2;//上下总路径（2h）
		printf("%f\n",H-100);//第一次无弹起-100
		h=h/2;//上升高度
	}

	return 0;
}

//_______________________________________________________________
//判断101-200之间有多少个素数，并输出所有素数。

int main()
{
	int i=0;//数字
	int j=0;//除数
	int k=0;//k=1素数；k=0合数；
	int h=0;//换行
	for(i=100;i<=200;i++)//101到200
	{
		k=1;
		for(j=2;j<(i/2);j++)//除数
		{
			if(i%j==0)//是否能被整除
				k=0;
		}
		if(k)
		{
			printf("%d ",i);
			h++;
			if(h%5==0)//每五个一换行
			printf("\n");
		}
	} 
	printf("\n");
	return 0;
}
//_______________________________________________________________
//有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
int main()
{	
	int a=0;//百位数
	int b=0;//十位数
	int c=0;//个位数
	int h=0;//换行

	for(a=1;a<5;a++)
	{
		for(b=1;(b<5);b++)
		{
			for(c=1;(c<5);c++)
			{
				if(a!=b&&a!=c&&b!=c)//a！=b！=c
				{
				printf("%-5d",a*100+b*10+c);
				h++;
				if(h%5==0)
						printf("\n");
				}
			}
		}
	}
printf("\n");
	return 0;
}
//_______________________________________________________________
//有一分数序列：2/1，3/2，5/3，8/5，13/8，21/13...
//求出这个数列的前20项之和。
int main()
{
	double x=2;//分子
	double y=1;//分母
	double s=0;//中间过度
	double sum=0;//和

	for(int i=1;i<21;i++)
	{
		s=x+y;
		sum=sum+x/y;
		printf("%f\n",sum);
		y=x;
		x=s;	
	}

	return 0;
}
//_______________________________________________________________
//求s=a+aa+aaa+aaaa+aa...a的值，其中a是一个数字。
//例如2+22+222+2222+22222(此时共有5个数相加)，
//几个数相加由键盘控制。
#include<math.h>
int main()
{
	int s=0;//相加结果
	int a=2;//其中一个数字
	int n=2;//n个数相加
	int m=0;//指数
	int num=0;//第n个数
	
	for(n--;n>=0;n--)
	{
		num=0;//重置
		for(m=n;m>=0;m--)
		{
			num=num+a*pow(10.0,m);
		}
		s=s+num;
	}
	printf("%d\n",s);

	return 0;
}